<details>
<summary>Execution result of "run-all plan" in "envs/prod"</summary>

```terraform
time=2024-03-29T09:17:30Z level=info msg=The stack at /github/workspace/envs/prod will be processed in the following order for command plan:
Group 1
- Module /github/workspace/envs/prod/vpc


time=2024-03-29T09:17:30Z level=info msg=Downloading Terraform configurations from file:///github/workspace/modules/vpc into /github/workspace/envs/prod/vpc/.terragrunt-cache/eFq5zdPJky14k-wjZi9Lp_Uq_Y4/giso1TTMUXQJkC634SOuk6GQWj0 prefix=[/github/workspace/envs/prod/vpc] 

Initializing the backend...

Successfully configured the backend "s3"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v5.39.0...
- Installed hashicorp/aws v5.39.0 (signed by HashiCorp)

Terraform has been successfully initialized!

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_internet_gateway.this will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "tgtest-prod-igw"
        }
      + tags_all = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-igw"
          + "Service"   = "tgtest"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.private will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "tgtest-prod-private-rt"
        }
      + tags_all         = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-private-rt"
          + "Service"   = "tgtest"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Name" = "tgtest-prod-public-rt"
        }
      + tags_all         = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-public-rt"
          + "Service"   = "tgtest"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.private will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_route_table_association.public will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_security_group.public_web will be created
  + resource "aws_security_group" "public_web" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
        ]
      + name                   = "tgtest-prod-public-web-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "tgtest-prod-public-web-sg"
        }
      + tags_all               = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-public-web-sg"
          + "Service"   = "tgtest"
        }
      + vpc_id                 = (known after apply)
    }

  # aws_subnet.private will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.16.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tgtest-prod-private-subnet"
        }
      + tags_all                                       = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-private-subnet"
          + "Service"   = "tgtest"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_subnet.public will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "ap-northeast-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.1.0.0/20"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name" = "tgtest-prod-public-subnet"
        }
      + tags_all                                       = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-public-subnet"
          + "Service"   = "tgtest"
        }
      + vpc_id                                         = (known after apply)
    }

  # aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.1.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = true
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name" = "tgtest-prod-vpc"
        }
      + tags_all                             = {
          + "Env"       = "prod"
          + "ManagedBy" = "Terraform"
          + "Name"      = "tgtest-prod-vpc"
          + "Service"   = "tgtest"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + private_route_table_id       = (known after apply)
  + public_route_table_id        = (known after apply)
  + public_subnet_id             = (known after apply)
  + public_web_security_group_id = (known after apply)
time=2024-03-29T09:17:40Z level=info msg=There are some problems with the CLI configuration:
╷
│ Error: The specified plugin cache dir /github/workspace/.terraform.d/plugin-cache cannot be opened: stat /github/workspace/.terraform.d/plugin-cache: no such file or directory
│
╵

As a result of the above problems, Terraform may not behave as intended.
```

</details>
    